Courses/7370/Lectures/DistFileSys/IPFS/Lectures/ipfs-demo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>IPFS Demo 2018 -WIP-</title>
<!-- 2018-09-03 Mon 17:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">IPFS Demo 2018 -WIP-</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Goal of this Lecture</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Give a demo of what IPFS offers, now in 2018.
</li>
<li>Prerequisite: Getting Started
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> A Hands-on Introduction to IPFS</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><code>go-ipfs/install.sh</code> a lame shell script
</li>
<li><code>ipfs daemon</code> Does not react to commands.  htop shows several ipfs
daemon processes, but ps aux | grep ipfs shows only one!
</li>

<li><a href="http://localhost:8080/ipfs/QmV9tSDx9UiPeWExXEeH6aoDvmihvx6jD5eLb4jbTaKGps">http://localhost:8080/ipfs/QmV9tSDx9UiPeWExXEeH6aoDvmihvx6jD5eLb4jbTaKGps</a>
   Draft#2 of Benet's IPFS White Paper
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> A Local IPFS of 4 Nodes</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>github.com/ipfs/ipfs-cluster
</li>

<li>192.168.17.111 home gateway AT&amp;T DSL
</li>
<li>192.168.1.100 IPFS Node#1
</li>
<li>192.168.2.100 IPFS Node#2
</li>
<li>192.168.3.100 IPFS Node#3
</li>
<li>192.168.4.100 IPFS Node#4
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Peer Discovery Mechanisms</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="https://github.com/libp2p/js-libp2p/tree/master/examples/discovery-mechanisms">https://github.com/libp2p/js-libp2p/tree/master/examples/discovery-mechanisms</a>
"A Peer Discovery module enables libp2p to find peers to connect
to. &#x2026; With these systems, a libp2p node can both have a set of
nodes to always connect on boot (bootstraper nodes), discover nodes
through locality (e.g connected in the same LAN) or through
serendipity (random walks on a DHT). These mechanisms save
configuration and enable a node to operate without any explicit
dials, it will just work."
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><a href="https://github.com/libp2p/js-libp2p/tree/master/examples">https://github.com/libp2p/js-libp2p/tree/master/examples</a>
</li>
<li><a href="https://medium.com/coinmonks/a-hands-on-introduction-to-ipfs-ee65b594937">https://medium.com/coinmonks/a-hands-on-introduction-to-ipfs-ee65b594937</a>
   A Hands-on Introduction to IPFS May 23, 2018.  An OK intro.
</li>
<li><a href="https://hackernoon.com/getting-deep-into-ethereum-how-data-is-stored-in-ethereum-e3f669d96033">https://hackernoon.com/getting-deep-into-ethereum-how-data-is-stored-in-ethereum-e3f669d96033</a>
</li>
<li><a href="https://hackernoon.com/setting-up-a-2-node-private-storage-network-on-ipfs-in-1-min-part-4-93ea41d4c551">https://hackernoon.com/setting-up-a-2-node-private-storage-network-on-ipfs-in-1-min-part-4-93ea41d4c551</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2018-08-04
</div>
</body>
</html>
